In [1]:
import pandas as pd
import csv

# Import files

In [2]:
movies_2018 = pd.read_csv("Resources/2018 pull/TMDB_pull_FINAL_2018_dropped_movies_17079.csv")
movies_2019 = pd.read_csv("Resources/TMDB_pull_FINAL_2019_dropped_movies_16258.csv")

netflix = pd.read_csv("Resources/Netflix_data/TMDB_pull_FINAL_Netflix_dropped_movies_524.csv")
movie_title = pd.read_csv("Resources/movie_title.csv")
movie_ratings = pd.read_csv("Resources/title.ratings.tsv",sep='\t')

# Clean movie_title

In [3]:
del movie_title["Unnamed: 0"]
del movie_title["isAdult"]

In [4]:
movie_title.head()

,tconst,titleType,primaryTitle,startYear,genres
0,tt0069049,movie,The Other Side of the Wind,2018,Drama
1,tt0072306,movie,Toula ou Le génie des eaux,2017,Drama
2,tt0077649,movie,Isolation of 1/8800000,2018,\N
3,tt0100275,movie,The Wandering Soap Opera,2017,"Comedy,Drama,Fantasy"
4,tt0111414,movie,A Thin Life,2018,Comedy

# Clean Years

In [5]:
def clean_year(file):
    del file["Unnamed: 0"]
    del file["ID"]
    del file["original_title"]
    return file

In [6]:
clean_year(movies_2018)
movies_2018.head(2)

,imdb_id,release_date,budget,revenue,genres,original_language,origin_country,production_countries name,spoken_languages name
0,tt1075113,2009-06-03,13000000,2651917,Drama,Français,FR,France,Français
1,tt1273221,2018-09-20,8000000,252676,Crime,English,GB,United Kingdom,English

In [7]:
movies_2018 = movies_2018.rename(columns={'imdb_id':'tconst'})

In [8]:
movies_2018.head(2)

,tconst,release_date,budget,revenue,genres,original_language,origin_country,production_countries name,spoken_languages name
0,tt1075113,2009-06-03,13000000,2651917,Drama,Français,FR,France,Français
1,tt1273221,2018-09-20,8000000,252676,Crime,English,GB,United Kingdom,English

In [9]:
# make profit% column (revenue-budget/budget*100)
# movies_2018['Profit %'] = (movies_2018['revenue']-movies_2018['budget'])/movies_2018['budget']*100

In [10]:
movies_2018.reset_index().head()
movies_2018 = movies_2018.drop(index=4)

In [11]:
movies_2018['budget'] = pd.to_numeric(movies_2018['budget'])
movies_2018['revenue'] = pd.to_numeric(movies_2018['revenue'])

movies_2018["Profit%"] = round((movies_2018['revenue']-movies_2018['budget'])/movies_2018['budget']*100,2)

In [12]:
movies_2018.head(2)

,tconst,release_date,budget,revenue,genres,original_language,origin_country,production_countries name,spoken_languages name,Profit%
0,tt1075113,2009-06-03,13000000,2651917,Drama,Français,FR,France,Français,-79.60
1,tt1273221,2018-09-20,8000000,252676,Crime,English,GB,United Kingdom,English,-96.84

In [16]:
clean_year(movies_2019)

,imdb_id,release_date,budget,revenue,genres,original_language,origin_country,production_countries name,spoken_languages name
0,tt0385887,2019-10-31,26000000,18377736,Drama,English,US,United States of America,English
1,tt10011102,2019-03-08,1000,1000,Action,हिन्दी,IN,India,हिन्दी
2,tt0048960,1956-10-17,6000000,42000000,Adventure,English,US,United States of America,English
3,tt1025100,2019-10-02,138000000,173469516,Action,English,CN,China,English
4,tt10256570,2019-12-19,4000000,8277796,Drama,Italiano,IT,Italy,Italiano
...,...,...,...,...,...,...,...,...,...
89,tt9260446,2019-04-18,8000000,5000000,Comedy,Italiano,IT,Italy,Italiano
90,tt9264336,2019-12-20,704334,3803406,Drama,NaN,IN,India,NaN
91,tt9564774,2019-12-13,3500000,10000000,Family,తెలుగు,IN,India,తెలుగు
92,tt9720440,2019-03-25,25000,2000,Thriller,NaN,UG,Uganda,NaN
93,tt9764654,2019-02-27,12547000,1091477,Drama,한국어/조선말,KR,South Korea,한국어/조선말